# Pandas

In [1]:
import numpy as np
import pandas as pd

## Series

In [4]:
label = ['a', 'b', 'c']
info = [1, 2, 3]
pd.Series(data = info, index = label)

a    1
b    2
c    3
dtype: int64

In [9]:
array = np.arange(5, 8)
labels = ['venta1', 'venta2', 'venta3']
serie = pd.Series(array, labels)

In [10]:
serie

venta1    5
venta2    6
venta3    7
dtype: int32

In [12]:
serie['venta2']

6

In [13]:
serie[2]

7

In [14]:
info2 = ['tech', 500, 'printer', 600, 'a']
info2

['tech', 500, 'printer', 600, 'a']

In [15]:
pd.Series(info2)

0       tech
1        500
2    printer
3        600
4          a
dtype: object

In [18]:
serie2 = pd.Series([1, 2, 3], ['a', 'b', 'v'])
serie3 = pd.Series([4, 5, 6], ['a', 'b', 'v'])

In [19]:
serie_add = serie2 + serie3

In [20]:
serie_add

a    5
b    7
v    9
dtype: int64

## DataFrames

In [21]:
rows = ['sale1', 'sale2', 'sale3']
columns = ['ZoneA', 'zoneB', 'zoneC']
dat = [[574, 558, 965], [856, 899, 204], [666, 574, 624]]

In [22]:
dataframe = pd.DataFrame(dat, rows, columns)

In [23]:
dataframe

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204
sale3    666    574    624

In [24]:
dataframe.loc['sale2']

ZoneA    856
zoneB    899
zoneC    204
Name: sale2, dtype: int64

In [27]:
dataframe.loc[['sale1', 'sale3']]

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale3    666    574    624

In [30]:
dataframe['ZoneA']

sale1    574
sale2    856
sale3    666
Name: ZoneA, dtype: int64

In [31]:
dataframe.loc['sale1']['ZoneA']

574

In [32]:
dataframe['total_sales'] = dataframe['ZoneA'] + dataframe['zoneB'] + dataframe['zoneC']

In [33]:
dataframe

       ZoneA  zoneB  zoneC  total_sales
sale1    574    558    965         2097
sale2    856    899    204         1959
sale3    666    574    624         1864

In [36]:
dataframe.drop('total_sales', axis = 1)

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204
sale3    666    574    624

In [37]:
dataframe

       ZoneA  zoneB  zoneC  total_sales
sale1    574    558    965         2097
sale2    856    899    204         1959
sale3    666    574    624         1864

In [38]:
dataframe.drop('total_sales', axis = 1, inplace = True)

In [39]:
dataframe

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204
sale3    666    574    624

In [40]:
dataframe.drop('sale3')

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204

In [41]:
dataframe

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204
sale3    666    574    624

In [42]:
dataframe.drop('sale3', inplace = True)

In [43]:
dataframe

       ZoneA  zoneB  zoneC
sale1    574    558    965
sale2    856    899    204

In [44]:
dataframe.shape

(2, 3)

### Select Data with a condition

In [45]:
rows = 'sale1 sale2 sale3'.split()
rows

['sale1', 'sale2', 'sale3']

In [47]:
columns = 'zoneA zoneB zoneC'.split()
columns

['zoneA', 'zoneB', 'zoneC']

In [48]:
info = [[5555, 5885, 9954], [5741, 2365, 9874], [5471, 5657, 2410]]
info

[[5555, 5885, 9954], [5741, 2365, 9874], [5471, 5657, 2410]]

In [49]:
dataframe = pd.DataFrame(info, rows, columns)

In [50]:
dataframe

       zoneA  zoneB  zoneC
sale1   5555   5885   9954
sale2   5741   2365   9874
sale3   5471   5657   2410

In [51]:
condition = dataframe > 5000

In [52]:
dataframe[condition]

       zoneA   zoneB   zoneC
sale1   5555  5885.0  9954.0
sale2   5741     NaN  9874.0
sale3   5471  5657.0     NaN

In [55]:
condition2 = (dataframe['zoneA'] > 5500) & (dataframe['zoneB'] > 5700)

In [56]:
dataframe[condition2]

       zoneA  zoneB  zoneC
sale1   5555   5885   9954

### Modify row names

In [58]:
rows = 'sale1 sale2 sale3'.split()
columns = 'zoneA zoneB zoneC'.split()
info = [[5555, 5885, 9954], [5741, 2365, 9874], [5471, 5657, 2410]]
dataframe = pd.DataFrame(info, rows, columns)

In [59]:
dataframe

       zoneA  zoneB  zoneC
sale1   5555   5885   9954
sale2   5741   2365   9874
sale3   5471   5657   2410

In [60]:
row_new = 'day1 day2 day3'.split()

In [61]:
dataframe['days'] = row_new

In [62]:
dataframe

       zoneA  zoneB  zoneC  days
sale1   5555   5885   9954  day1
sale2   5741   2365   9874  day2
sale3   5471   5657   2410  day3

In [63]:
dataframe.set_index('days')

      zoneA  zoneB  zoneC
days
day1   5555   5885   9954
day2   5741   2365   9874
day3   5471   5657   2410

In [64]:
dataframe

       zoneA  zoneB  zoneC  days
sale1   5555   5885   9954  day1
sale2   5741   2365   9874  day2
sale3   5471   5657   2410  day3

In [65]:
dataframe = dataframe.set_index('days')

In [66]:
dataframe

      zoneA  zoneB  zoneC
days
day1   5555   5885   9954
day2   5741   2365   9874
day3   5471   5657   2410

### Null data

In [67]:
dictionary = {'a': [4, 5, np.nan], 'b': [6, 1, 5], 'c': [np.nan, 4, np.nan]}

In [68]:
dataframe2 = pd.DataFrame(dictionary)

In [69]:
dataframe2

     a  b    c
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [70]:
dataframe2.dropna()

     a  b    c
1  5.0  1  4.0

In [71]:
dataframe2.dropna(axis = 1)

   b
0  6
1  1
2  5

In [73]:
dataframe2.fillna(value = 100)

       a  b      c
0    4.0  6  100.0
1    5.0  1    4.0
2  100.0  5  100.0

In [74]:
medium_value = dataframe2.mean()
medium_value

a    4.5
b    4.0
c    4.0
dtype: float64

In [75]:
dataframe2.fillna(value = medium_value)

     a  b    c
0  4.0  6  4.0
1  5.0  1  4.0
2  4.5  5  4.0

### Group data

In [5]:
dictionary = {'days': ['day1', 'day1', 'day2', 'day2', 'day3'], 'sellers': ['Carlos', 'Valeria', 'Maria', 'Rosalba', 'Edgar'], 'sales': [8558, 58597, 554710, 52236, 45587]}

In [6]:
dataframe = pd.DataFrame(dictionary)

In [7]:
dataframe

   days  sellers   sales
0  day1   Carlos    8558
1  day1  Valeria   58597
2  day2    Maria  554710
3  day2  Rosalba   52236
4  day3    Edgar   45587

In [9]:
dataframe.groupby('days').mean()

C:\Users\carlo\AppData\Local\Temp\ipykernel_17508\4089846049.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  dataframe.groupby('days').mean()

         sales
days
day1   33577.5
day2  303473.0
day3   45587.0

In [10]:
dataframe.groupby('days').describe()

     sales                                                                    \
     count      mean            std      min        25%       50%        75%
days
day1   2.0   33577.5   35382.916224   8558.0   21067.75   33577.5   46087.25
day2   2.0  303473.0  355302.772770  52236.0  177854.50  303473.0  429091.50
day3   1.0   45587.0            NaN  45587.0   45587.00   45587.0   45587.00


           max
days
day1   58597.0
day2  554710.0
day3   45587.0

### Combine DataFrames

In [11]:
dic = {'A' : [1, 2, 3], 'B' : [ 4, 5, 6], 'C' : [7, 8, 9]}

In [12]:
dat = pd.DataFrame(dic)

In [13]:
dat

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [14]:
dic2 = {'A' : [10, 20, 30], 'B' : [ 40, 50, 60], 'C' : [70, 80, 90]}

In [15]:
dat2 = pd.DataFrame(dic2)

In [16]:
dat2

    A   B   C
0  10  40  70
1  20  50  80
2  30  60  90

In [17]:
pd.concat([dat, dat2])

    A   B   C
0   1   4   7
1   2   5   8
2   3   6   9
0  10  40  70
1  20  50  80
2  30  60  90

In [18]:
pd.concat([dat, dat2], axis=1)

   A  B  C   A   B   C
0  1  4  7  10  40  70
1  2  5  8  20  50  80
2  3  6  9  30  60  90

### Merge DataFrames

In [22]:
dicti = {'A' : [1, 2, 3], 'B' : [ 4, 5, 6], 'Clave' : ['c1', 'c2', 'c3']}

In [23]:
data = pd.DataFrame(dicti)

In [24]:
data

   A  B Clave
0  1  4    c1
1  2  5    c2
2  3  6    c3

In [25]:
dicti2 = {'A' : [11, 12, 13], 'B' : [ 14, 15, 16], 'Clave' : ['c1', 'c2', 'c3']}

In [27]:
data2 = pd.DataFrame(dicti2)

In [28]:
data2

    A   B Clave
0  11  14    c1
1  12  15    c2
2  13  16    c3

In [29]:
pd.merge(data, data2, on='Clave')

   A_x  B_x Clave  A_y  B_y
0    1    4    c1   11   14
1    2    5    c2   12   15
2    3    6    c3   13   16

### Join DataFrames

In [32]:
dictio = {'A' : [1, 2, 3], 'B' : [ 4, 5, 6]}
dataf = pd.DataFrame(dictio, index = ['i1', 'i2', 'i3'])

In [33]:
dataf

    A  B
i1  1  4
i2  2  5
i3  3  6

In [39]:
dictio2 = {'C' : [11, 12, 13], 'D' : [ 14, 15, 16]}
dataf2 = pd.DataFrame(dictio2, index = ['i1', 'i2', 'i3'])

In [40]:
dataf2

     C   D
i1  11  14
i2  12  15
i3  13  16

In [41]:
dataf.join(dataf2)

    A  B   C   D
i1  1  4  11  14
i2  2  5  12  15
i3  3  6  13  16

### Operations

In [42]:
dicc = {'A' : [11, 12, 13, 12], 'B' : [ 14, 15, 16, 17]}

In [43]:
datafr = pd.DataFrame(dicc, index = ['i1', 'i2', 'i3', 'i4'])

In [44]:
datafr

     A   B
i1  11  14
i2  12  15
i3  13  16
i4  12  17

In [45]:
datafr['A'].unique()

array([11, 12, 13], dtype=int64)

In [46]:
datafr['A'].nunique()

3

In [47]:
datafr['A'].value_counts()

12    2
11    1
13    1
Name: A, dtype: int64

In [48]:
def multiplicar(x):
    return x * 2

In [49]:
datafr['A'].apply(multiplicar)

i1    22
i2    24
i3    26
i4    24
Name: A, dtype: int64

In [50]:
datafr['A'].apply(lambda x: x * 2)

i1    22
i2    24
i3    26
i4    24
Name: A, dtype: int64

In [52]:
datafr.drop('B', axis=1)

     A
i1  11
i2  12
i3  13
i4  12

In [54]:
datafr.drop('i1')

     A   B
i2  12  15
i3  13  16
i4  12  17

In [55]:
datafr.columns

Index(['A', 'B'], dtype='object')

In [ ]:
datafr.sort_values